In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C:\Intern online\Mall_Customers.csv")

In [3]:
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [16]:
df.shape
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   customerid            200 non-null    int64
 1   gender                200 non-null    object
 2   age                   200 non-null    int64
 3   annual_income_k$      200 non-null    int64
 4   spending_score_1_100  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

       customerid         age  annual_income_k$  spending_score_1_100
count  200.000000  200.000000        200.000000            200.000000
mean   100.500000   38.850000         60.560000             50.200000
std     57.879185   13.969007         26.264721             25.823522
min      1.000000   18.000000         15.000000              1.000000
25%     50.750000   28.750000         41.500000             34.750000
50%    100.500000   36.000000         61.500000             50.000000
75%    150.250000   49.000000         78.000000             73.000000
max    200.000000   70.000000        137.000000             99.000000

In [5]:
df.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [6]:
df.duplicated().sum()

np.int64(0)

In [7]:
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(" ", "_")
df.columns = df.columns.str.replace("(", "")
df.columns = df.columns.str.replace(")", "")
df.columns = df.columns.str.replace("-", "_")

In [8]:
df.columns

Index(['customerid', 'gender', 'age', 'annual_income_k$',
       'spending_score_1_100'],
      dtype='object')

In [9]:
df.tail()

     customerid  gender  age  annual_income_k$  spending_score_1_100
195         196  Female   35               120                    79
196         197  Female   45               126                    28
197         198    Male   32               126                    74
198         199    Male   32               137                    18
199         200    Male   30               137                    83

In [10]:
df["gender"].unique()

array(['Male', 'Female'], dtype=object)

In [11]:
df.dtypes

customerid               int64
gender                  object
age                      int64
annual_income_k$         int64
spending_score_1_100     int64
dtype: object

In [12]:
df.describe()

       customerid         age  annual_income_k$  spending_score_1_100
count  200.000000  200.000000        200.000000            200.000000
mean   100.500000   38.850000         60.560000             50.200000
std     57.879185   13.969007         26.264721             25.823522
min      1.000000   18.000000         15.000000              1.000000
25%     50.750000   28.750000         41.500000             34.750000
50%    100.500000   36.000000         61.500000             50.000000
75%    150.250000   49.000000         78.000000             73.000000
max    200.000000   70.000000        137.000000             99.000000

In [13]:
df=df[df["age"]< 100]

In [14]:
df

     customerid  gender  age  annual_income_k$  spending_score_1_100
0             1    Male   19                15                    39
1             2    Male   21                15                    81
2             3  Female   20                16                     6
3             4  Female   23                16                    77
4             5  Female   31                17                    40
..          ...     ...  ...               ...                   ...
195         196  Female   35               120                    79
196         197  Female   45               126                    28
197         198    Male   32               126                    74
198         199    Male   32               137                    18
199         200    Male   30               137                    83

[200 rows x 5 columns]

In [15]:
df.to_csv("cleaned_mall_customers.csv", index=False)